In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
obj1 = pd.read_csv("titanic_data.csv")

In [2]:
obj1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
obj1.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
obj1.shape

(891, 12)

In [5]:
obj1.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
print("The mean age value is : ",obj1.Age.mean())

The mean age value is :  29.69911764705882

In [7]:
obj1.Age = obj1.Age.fillna(obj1.Age.mean())

In [8]:
obj1.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,NaN,C

In [9]:
# Checking for unique values in embarked column
obj1.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [10]:
obj1.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
# Dropping the non-numeric columns
obj1.drop(['PassengerId','Name','Ticket','Cabin'],axis=1,inplace = True)

In [12]:
obj1.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [13]:
# Using label binarizer on column Sex
from sklearn import preprocessing
lb1 = preprocessing.LabelBinarizer()
obj1.Sex = lb1.fit_transform(obj1.Sex)

In [14]:
# Male = 1 and Female = 0
obj1.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    1  22.0      1      0   7.2500        S
1         1       1    0  38.0      1      0  71.2833        C
2         1       3    0  26.0      0      0   7.9250        S
3         1       1    0  35.0      1      0  53.1000        S
4         0       3    1  35.0      0      0   8.0500        S

In [15]:
# finding mode and filling the NaN values in the column Embarked
print("Mode value for column Embarked : ",obj1.Embarked.mode())

Mode value for column Embarked :  0    S
Name: Embarked, dtype: object

In [16]:
obj1.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [17]:
obj1.to_csv("TITANIC_ASSIGNMENT1.csv")

In [18]:
#obj1.Embarked = obj1.Embarked.fillna(obj1.Embarked.mode())

In [19]:
obj1.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [20]:
type(obj1.Embarked)

pandas.core.series.Series

In [21]:
obj1.Embarked = obj1.Embarked.fillna('S')

In [22]:
obj1.Embarked.unique()

array(['S', 'C', 'Q'], dtype=object)

In [23]:
obj1.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [24]:
obj1.iloc[55:65,:]

    Survived  Pclass  Sex        Age  SibSp  Parch     Fare Embarked
55         1       1    1  29.699118      0      0  35.5000        S
56         1       2    0  21.000000      0      0  10.5000        S
57         0       3    1  28.500000      0      0   7.2292        C
58         1       2    0   5.000000      1      2  27.7500        S
59         0       3    1  11.000000      5      2  46.9000        S
60         0       3    1  22.000000      0      0   7.2292        C
61         1       1    0  38.000000      0      0  80.0000        S
62         0       1    1  45.000000      1      0  83.4750        S
63         0       3    1   4.000000      3      2  27.9000        S
64         0       1    1  29.699118      0      0  27.7208        C

In [25]:
# Creating Dummies for the column Embarked
obj1_dummies = pd.get_dummies(obj1['Embarked'] , prefix='Embarked' ,drop_first = False)
obj1 = pd.concat([obj1,obj1_dummies],axis=1)
del obj1['Embarked']
obj1.iloc[55:65,:]

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
55,1,1,1,29.699118,0,0,35.5000,False,False,True
56,1,2,0,21.000000,0,0,10.5000,False,False,True
57,0,3,1,28.500000,0,0,7.2292,True,False,False
58,1,2,0,5.000000,1,2,27.7500,False,False,True
59,0,3,1,11.000000,5,2,46.9000,False,False,True
60,0,3,1,22.000000,0,0,7.2292,True,False,False
61,1,1,0,38.000000,0,0,80.0000,False,False,True
62,0,1,1,45.000000,1,0,83.4750,False,False,True
63,0,3,1,4.000000,3,2,27.9000,False,False,True
64,0,1,1,29.699118,0,0,27.7208,True,False,False

In [26]:
obj1.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked_C', 'Embarked_Q', 'Embarked_S'],
      dtype='object')

In [27]:
from sklearn import linear_model
X = obj1[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare','Embarked_C', 'Embarked_Q', 'Embarked_S']]
Y = obj1.Survived

In [28]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size=0.2,random_state=0)

In [29]:
obj2 = linear_model.LinearRegression()

In [30]:
obj2.fit(X_train,Y_train)

LinearRegression()

In [31]:
obj2.coef_

array([-1.65723000e-01, -5.05727011e-01, -6.38200310e-03, -4.67821956e-02,
       -1.10888107e-02,  2.90617278e-04,  3.07988229e-03,  3.77796766e-02,
       -4.08595589e-02])

In [32]:
obj2.intercept_

1.333222990936796

In [33]:
print(X_test)

     Pclass  Sex        Age  SibSp  Parch      Fare  Embarked_C  Embarked_Q  \
495       3    1  29.699118      0      0   14.4583        True       False
648       3    1  29.699118      0      0    7.5500       False       False
278       3    1   7.000000      4      1   29.1250       False        True
31        1    0  29.699118      1      0  146.5208        True       False
255       3    0  29.000000      0      2   15.2458        True       False
..      ...  ...        ...    ...    ...       ...         ...         ...
780       3    0  13.000000      0      0    7.2292        True       False
837       3    1  29.699118      0      0    8.0500       False       False
215       1    0  31.000000      1      0  113.2750        True       False
833       3    1  23.000000      0      0    7.8542       False       False
372       3    1  19.000000      0      0    8.0500       False       False

     Embarked_S
495       False
648        True
278       False
31        False
255       False
..          ...
780       False
837        True
215       False
833        True
372        True

[179 rows x 9 columns]

In [34]:
obj2.predict(X_test)

array([ 1.48068833e-01,  1.02121720e-01,  1.33679269e-01,  9.76839293e-01,
        6.36308855e-01,  4.40237387e-01,  9.15959162e-01,  9.54533826e-01,
        4.84989778e-01,  6.51694942e-01,  7.90357106e-02,  7.09415332e-01,
        1.80819079e-01,  9.01694492e-01,  1.04157904e+00,  7.08128954e-01,
        1.45362294e-01,  2.86741541e-01,  6.84367812e-02,  3.22112710e-01,
        3.43656464e-01,  1.03027941e+00,  1.80815446e-01,  4.40382696e-01,
        6.57649311e-01,  8.96516767e-01,  8.75379773e-02,  6.57042647e-01,
        7.97834593e-01,  6.28014439e-01,  1.25318232e-01,  6.44868758e-01,
        1.13532198e-01,  4.41690473e-01,  5.96547663e-02,  4.69492590e-01,
        1.69157688e-02,  2.79545815e-01,  2.99418368e-01,  1.14630895e-01,
        2.47078558e-01,  1.75956494e-01,  1.04141510e-01,  1.34356572e-02,
        8.80747405e-01,  1.02222216e-01,  1.02222216e-01,  1.01621251e+00,
        2.10070324e-01,  2.54325920e-01,  4.40092078e-01,  5.25390997e-01,
        8.84202610e-01,  1.70504018e-01,  4.83944334e-01,  2.29818325e-01,
        2.32945117e-01,  5.24775049e-01,  7.12314034e-02,  9.17592556e-02,
        1.95103724e-01,  5.71885858e-01,  8.01915165e-01,  4.86821445e-01,
        6.03938256e-01,  1.66134841e-01,  8.21457754e-01,  2.74995893e-01,
        8.97838469e-01,  1.01410089e+00,  7.68523211e-01,  2.82907175e-01,
        4.63254834e-01,  1.02267029e-01,  1.35447814e-01,  6.35213715e-01,
        4.13563498e-01,  4.17628882e-01,  7.43671069e-02,  3.13963791e-01,
        1.38803007e-01,  1.78779201e-01,  7.44670394e-01,  1.89614920e-01,
        1.69174327e-01,  1.01527440e+00,  9.68658439e-01,  3.95914530e-01,
        7.46980808e-01,  5.34842832e-01,  4.31373560e-01,  1.70504018e-01,
        3.85729454e-01,  8.95532683e-01,  5.83340418e-01,  1.45967931e-01,
        7.89785687e-01,  6.71650996e-04,  2.45709124e-01,  5.14837610e-01,
       -4.23392720e-02,  7.13361069e-02,  1.70432584e-01,  1.19002925e-01,
        5.55285919e-01,  5.19838317e-01,  7.85897654e-01,  4.89622124e-01,
        2.56414197e-01,  6.42016178e-01, -1.45861619e-02,  9.91131503e-01,
        1.01661977e-01,  6.07994040e-01,  3.57075566e-01,  7.85999370e-01,
        5.99850445e-01,  1.07504432e+00,  3.64819525e-02,  6.23484990e-01,
        1.16346215e-01,  1.81024923e-01,  1.64344831e-01,  3.78397303e-01,
        8.13763784e-02,  3.03328015e-01,  1.45966711e-01,  8.53946968e-02,
        2.65650560e-01,  1.33348244e-01,  7.42063886e-01,  1.57784825e-01,
        1.31966195e-01,  6.23627489e-01,  2.20021272e-01,  1.57784825e-01,
        1.34036883e-01,  4.95885711e-01,  1.35156138e-01,  3.12182374e-01,
        2.80272359e-01,  9.74046924e-01,  1.02267029e-01,  7.60919278e-01,
        7.80967941e-01,  6.44598320e-01,  2.67508352e-01,  6.53647155e-01,
        9.12324729e-01,  1.02445032e-01,  3.11200363e-01,  6.07359789e-01,
        5.61846610e-01,  1.06648880e-01,  8.99850228e-01,  2.92309822e-01,
        5.45055563e-01,  6.25577100e-02,  6.86546090e-01,  7.35290963e-01,
        1.02222216e-01,  2.07867730e-01,  7.96432176e-01,  4.48848026e-01,
        1.81906739e-01,  1.32140565e-01, -3.39646651e-02,  1.51328947e-01,
        1.38594002e-01,  1.83490840e-01, -3.36752684e-02,  9.01997718e-01,
        1.02034535e-01,  1.04141510e-01,  7.58268763e-01,  1.02267029e-01,
        9.58875253e-01,  1.44963916e-01,  1.70548831e-01])

In [35]:
Y_predicted = obj2.predict(X_test)

In [36]:
type(Y_predicted)

numpy.ndarray

In [37]:
list_pred = Y_predicted.tolist()

In [38]:
predictions = [round(num,1) for num in list_pred]

In [39]:
print(predictions)

[0.1, 0.1, 0.1, 1.0, 0.6, 0.4, 0.9, 1.0, 0.5, 0.7, 0.1, 0.7, 0.2, 0.9, 1.0, 0.7, 0.1, 0.3, 0.1, 0.3, 0.3, 1.0, 0.2, 0.4, 0.7, 0.9, 0.1, 0.7, 0.8, 0.6, 0.1, 0.6, 0.1, 0.4, 0.1, 0.5, 0.0, 0.3, 0.3, 0.1, 0.2, 0.2, 0.1, 0.0, 0.9, 0.1, 0.1, 1.0, 0.2, 0.3, 0.4, 0.5, 0.9, 0.2, 0.5, 0.2, 0.2, 0.5, 0.1, 0.1, 0.2, 0.6, 0.8, 0.5, 0.6, 0.2, 0.8, 0.3, 0.9, 1.0, 0.8, 0.3, 0.5, 0.1, 0.1, 0.6, 0.4, 0.4, 0.1, 0.3, 0.1, 0.2, 0.7, 0.2, 0.2, 1.0, 1.0, 0.4, 0.7, 0.5, 0.4, 0.2, 0.4, 0.9, 0.6, 0.1, 0.8, 0.0, 0.2, 0.5, -0.0, 0.1, 0.2, 0.1, 0.6, 0.5, 0.8, 0.5, 0.3, 0.6, -0.0, 1.0, 0.1, 0.6, 0.4, 0.8, 0.6, 1.1, 0.0, 0.6, 0.1, 0.2, 0.2, 0.4, 0.1, 0.3, 0.1, 0.1, 0.3, 0.1, 0.7, 0.2, 0.1, 0.6, 0.2, 0.2, 0.1, 0.5, 0.1, 0.3, 0.3, 1.0, 0.1, 0.8, 0.8, 0.6, 0.3, 0.7, 0.9, 0.1, 0.3, 0.6, 0.6, 0.1, 0.9, 0.3, 0.5, 0.1, 0.7, 0.7, 0.1, 0.2, 0.8, 0.4, 0.2, 0.1, -0.0, 0.2, 0.1, 0.2, -0.0, 0.9, 0.1, 0.1, 0.8, 0.1, 1.0, 0.1, 0.2]

In [40]:
obj1.iloc[493:496,:]

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
493,0,1,1,71.000000,0,0,49.5042,True,False,False
494,0,3,1,21.000000,0,0,8.0500,False,False,True
495,0,3,1,29.699118,0,0,14.4583,True,False,False

In [41]:
obj1.iloc[647:650,:]

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
647,1,1,1,56.000000,0,0,35.50,True,False,False
648,0,3,1,29.699118,0,0,7.55,False,False,True
649,1,3,0,23.000000,0,0,7.55,False,False,True

In [42]:
print(X_test)

     Pclass  Sex        Age  SibSp  Parch      Fare  Embarked_C  Embarked_Q  \
495       3    1  29.699118      0      0   14.4583        True       False
648       3    1  29.699118      0      0    7.5500       False       False
278       3    1   7.000000      4      1   29.1250       False        True
31        1    0  29.699118      1      0  146.5208        True       False
255       3    0  29.000000      0      2   15.2458        True       False
..      ...  ...        ...    ...    ...       ...         ...         ...
780       3    0  13.000000      0      0    7.2292        True       False
837       3    1  29.699118      0      0    8.0500       False       False
215       1    0  31.000000      1      0  113.2750        True       False
833       3    1  23.000000      0      0    7.8542       False       False
372       3    1  19.000000      0      0    8.0500       False       False

     Embarked_S
495       False
648        True
278       False
31        False
255       False
..          ...
780       False
837        True
215       False
833        True
372        True

[179 rows x 9 columns]

In [43]:
predicted = [1 if i >= 0.5 else 0 for i in predictions ]
print(predicted)

[0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0]

In [44]:
from sklearn.metrics import accuracy_score

# The mean squared error

print("Mean squared error: %.2f" % np.mean((obj2.predict(X_test) - Y_test) ** 2))


print("Accuracy Score : ",accuracy_score(predicted,Y_test))

Mean squared error: 0.14
Accuracy Score :  0.7877094972067039